Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Properties
The TransformationPlane type exposes the following members.
Properties
Name | Description
TransformationMatrixToGlobal
 Gives a transformation matrix for converting local points in the transformation plane to global coordinates.
TransformationMatrixToLocal
 Gives a transformation matrix for converting points in the global plane to local coordinates in the transformation plane.
Top
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace